<?php
$_['text_error_req'] =' %s الحقل يجب ان يحتوي علي قيمه ';
$_['text_error_num'] =' %s الحقل يجب ان يكون رقم';
$_['text_error_int'] =' %s الحقل يجب ان يكون رقم صحيح';
$_['text_error_float'] =' %s الحقل يجب ان يكون رقم عشري';
$_['text_error_alpha'] =' %s الحقل يجب يحتوي علي احرف فقط   ';
$_['text_error_alphanum'] =' %s الحقل يجب يحتوي علي احرف وارقام فقط   ';
$_['text_error_eq_Field'] =' %sيجب ان تكون قيمته مساويه  %s  ';
$_['text_error_eq'] =' %sيجب ان  تتساوي قيمته مع  %s  ';
$_['text_error_lt'] =' %s الحقل يجب ان يكون اقل %s  ';
$_['text_error_gt'] =' %s الحقل يجب ان يكون ااكتر من %s  ';
$_['text_error_min'] ='الحقل %s يجب ان تكون قيمه علي الاقل %s (احرف ان كان نصيا)  ';
$_['text_error_max'] ='الحقل %s يجب ان تكون قيمه علي الاكثر %s (احرف ان كان نصيا)  ';
$_['text_error_between'] ='الحقل %s يجب ان تكون قيمه ما بين %s و %s (احرف علي نصيا)   ';
$_['text_error_floatlike'] ='الحقل %s يجب ان يكون رقم عشري مكون من %s رقم قبل العلامه و%s رقم بعدالعلامه   ';
$_['text_error_vdate'] ='الحقل  %s يجب ان يكون تاريخ بتنسيقYYYY-mm-dd     ';
$_['text_error_email'] ='الحقل  %s يجب ان يكون بريد الكترونيا ex:someone@mail.com  ';
$_['text_error_url'] ='الحقل  %s يجب ان يكون رابط صحيح ex:http://www.abc.com  ';
